{
    "introduction": "Han Yan",
    "email": "fqw6pv@virginia.edu",
    "phone": "805-905-5791",
    "experience": [
        {
            "company": "CICC",
            "role": "Java Quantitative Developer - Equity Trading Summer Intern",
            "duration": "July 2024 - Aug 2024",
            "responsibilities": [
                "Implemented a Java class dataloader for MySQL using Spring Boot and Hibernate, substituting KDB dataloader for hdf5 file live stock ticks from stock exchanges, ensuring seamless integration with existing systems.",
                "Developed the SSE, SZSE, and HKSE stock exchange simulation utilizing JQuantLib and ZeroMQ for near-perfect orderbook snapshot recovery, ensuring accurate back-testing of trading strategies.",
                "Expanded the 10-depth level 2 market data provided by the stock exchange to show all orders in the order book for more comprehensive strategy back-testing, providing over 300% additional proprietary data for the quant research team, enabling more detailed analysis than publicly available information."
            ]
        },
        {
            "company": "UVA Engineering, Charlottesville, VA",
            "role": "Multiple Positions",
            "duration": "April 2022 - May 2024",
            "responsibilities": [
                "Developed the distributed data infrastructure for disaster response and fast decision support with Next.js, Node.js, TypeScript, PostgreSQL, Prisma, and Mapbox.",
                "Extracted data from AWS DynamoDB and integrated MySQL with InnoDB to optimize storage and retrieval, enhancing the system's capability to manage large-scale financial datasets. (Full Stack Engineer)",
                "Utilized Python to construct a community dictionary for global BGP network protocols, boosting network understanding and management by extracting detailed information for thousands of IP addresses on RADB. (Research Assistant)",
                "Researched and experimented with the NLP model BERT, adjusting model parameters to reduce noise and optimize threshold and batch sizes for improved on-device NLP training efficiency. (Research Assistant)",
                "Led and managed lab sessions, teaching introductory computer architecture in C and assembly, and assisted 438 students with debugging assignments. (Head Teaching Assistant)"
            ]
        },
        {
            "company": "Mastercard, O'Fallon, MO",
            "role": "Infrastructure Software Engineer Intern (System Platform Engineer)",
            "duration": "June 2023 - August 2023",
            "responsibilities": [
                "Led the transition from classic Endevor mainframe development to a modern DevOps environment using Azure DevOps, Zowe CLI, Node.js, and Jenkins API integration, significantly enhancing the development workflow for a team of -100 engineers.",
                "Managed Ansible Tower Docker image in a zCX with a CentoS environment.",
                "Contributed to the full-stack team's Angular project using TypeScript and Angular, enhancing the frontend's responsiveness and user experience.",
                "Analyzed infrastructure OS processing data using SPLUNK and MySQL Performance Schema to monitor and report irregular activities, ensuring system integrity and performance."
            ]
        }
    ],
    "skills": [
        "Java (Spring Boot, Hibernate, J2EE)",
        "Python",
        "C/C++",
        "React",
        "Node.js",
        "Angular",
        "AWS",
        "Azure DevOps",
        "SQLite",
        "Docker",
        "Shell",
        "SQL",
        "Linux",
        "JavaScript",
        "Linear Algebra",
        "Probability Theory",
        "Machine Learning",
        "Artificial Intelligence",
        "R",
        "Equity & Option Trading",
        "Tableau",
        "Financial Accounting",
        "Managerial Accounting"
    ],
    "education": [
        {
            "degree": "Bachelor's in Computer Science & Statistics, Data Science minor",
            "institution": "University of Virginia",
            "graduation_year": "2025"
        }
    ]
}